## Terraform Plan — Production

<details>
<summary>Click to expand plan output</summary>

```hcl
data.aws_ssm_parameter.api_token: Reading...
data.aws_ecr_repository.api[0]: Reading...
data.aws_ecr_repository.worker[0]: Reading...
data.aws_caller_identity.current: Reading...
module.network.data.aws_region.current: Reading...
module.network.data.aws_region.current: Read complete after 0s [id=us-east-2]
data.aws_caller_identity.current: Read complete after 0s [id=214422569286]
data.aws_ssm_parameter.api_token: Read complete after 1s [id=/exam-costa/production/api/token]
data.aws_ecr_repository.api[0]: Read complete after 1s [id=exam-costa-api]
data.aws_ecr_repository.worker[0]: Read complete after 1s [id=exam-costa-worker]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_dashboard.main[0] will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (known after apply)
      + dashboard_name = "exam-costa-production"
      + id             = (known after apply)
    }

  # aws_cloudwatch_metric_alarm.alb_unhealthy_targets[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "alb_unhealthy_targets" {
      + actions_enabled                       = true
      + alarm_description                     = "Alert when ALB has unhealthy targets"
      + alarm_name                            = "exam-costa-production-alb-unhealthy-targets"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "UnHealthyHostCount"
      + namespace                             = "AWS/ApplicationELB"
      + period                                = 60
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + threshold                             = 0
      + treat_missing_data                    = "missing"
    }

  # aws_cloudwatch_metric_alarm.sqs_queue_depth[0] will be created
  + resource "aws_cloudwatch_metric_alarm" "sqs_queue_depth" {
      + actions_enabled                       = true
      + alarm_description                     = "Alert when SQS queue has too many messages"
      + alarm_name                            = "exam-costa-production-sqs-queue-depth"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "QueueName" = "exam-costa-production-messages"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "ApproximateNumberOfMessagesVisible"
      + namespace                             = "AWS/SQS"
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + threshold                             = 1000
      + treat_missing_data                    = "missing"
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from anywhere"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS from anywhere"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "exam-costa-production-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-alb-sg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-alb-sg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.api_service will be created
  + resource "aws_security_group" "api_service" {
      + arn                    = (known after apply)
      + description            = "Security group for API service"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = "Allow traffic from ALB"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8000
            },
        ]
      + name                   = "exam-costa-production-api-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-api-service-sg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-api-service-sg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.worker_service will be created
  + resource "aws_security_group" "worker_service" {
      + arn                    = (known after apply)
      + description            = "Security group for Worker service"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "exam-costa-production-worker-service-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-worker-service-sg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-worker-service-sg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_ssm_parameter.cloudwatch_dashboard_url[0] will be created
  + resource "aws_ssm_parameter" "cloudwatch_dashboard_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/cloudwatch_dashboard_url"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/cloudwatch_dashboard_url"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/cloudwatch_dashboard_url"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.infra_output["alb_url"] will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/alb_url"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/alb_url"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/alb_url"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.infra_output["api_service_name"] will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/api_service_name"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/api_service_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/api_service_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.infra_output["ecs_cluster_name"] will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/ecs_cluster_name"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/ecs_cluster_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/ecs_cluster_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.infra_output["s3_bucket_name"] will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/s3_bucket_name"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/s3_bucket_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/s3_bucket_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.infra_output["sqs_queue_url"] will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/sqs_queue_url"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/sqs_queue_url"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/sqs_queue_url"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.infra_output["worker_service_name"] will be created
  + resource "aws_ssm_parameter" "infra_output" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/exam-costa/production/outputs/worker_service_name"
      + overwrite      = true
      + tags           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/worker_service_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "/exam-costa/production/outputs/worker_service_name"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.alb.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "exam-costa-production-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-alb"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                                                     = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-alb"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.alb.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                                                              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.main will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "30"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "exam-costa-production-alb-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-alb-tg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-alb-tg"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthz"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "exam-costa-production-cluster"
      + tags     = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-cluster"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-cluster"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.main will be created
  + resource "aws_ecs_cluster_capacity_providers" "main" {
      + capacity_providers = [
          + "FARGATE",
          + "FARGATE_SPOT",
        ]
      + cluster_name       = "exam-costa-production-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 1
        }
    }

  # module.ecs_service_api.aws_cloudwatch_log_group.service will be created
  + resource "aws_cloudwatch_log_group" "service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/exam-costa-production-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all          = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
    }

  # module.ecs_service_api.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = false
      + health_check_grace_period_seconds  = 60
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "exam-costa-production-api"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_service_api.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "exam-costa-production-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                 = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs_service_worker.aws_cloudwatch_log_group.service will be created
  + resource "aws_cloudwatch_log_group" "service" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/exam-costa-production-worker"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all          = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
    }

  # module.ecs_service_worker.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "exam-costa-production-worker"
      + platform_version                   = "LATEST"
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs_service_worker.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "exam-costa-production-worker"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                 = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.iam_api_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for API service tasks"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "exam-costa-production-api-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-api-task-role"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-api-task-role"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_api_task_role.aws_iam_role_policy.inline["sqs_send"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "sqs_send"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.iam_api_task_role.aws_iam_role_policy.inline["ssm_access"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "ssm_access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:214422569286:parameter/exam-costa/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.iam_ecs_execution_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "ECS task execution role for exam-costa"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "exam-costa-production-ecs-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-ecs-execution-role"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-ecs-execution-role"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_ecs_execution_role.aws_iam_role_policy_attachment.managed[0] will be created
  + resource "aws_iam_role_policy_attachment" "managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "exam-costa-production-ecs-execution-role"
    }

  # module.iam_worker_task_role.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for Worker service tasks"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "exam-costa-production-worker-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-worker-task-role"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all              = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-worker-task-role"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + unique_id             = (known after apply)
    }

  # module.iam_worker_task_role.aws_iam_role_policy.inline["s3_upload"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "s3_upload"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.iam_worker_task_role.aws_iam_role_policy.inline["sqs_receive"] will be created
  + resource "aws_iam_role_policy" "inline" {
      + id          = (known after apply)
      + name        = "sqs_receive"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = (known after apply)
    }

  # module.network.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-nat-eip-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all             = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-nat-eip-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + vpc                  = (known after apply)
    }

  # module.network.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-igw"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-igw"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + vpc_id   = (known after apply)
    }

  # module.network.aws_nat_gateway.main[0] will be created
  + resource "aws_nat_gateway" "main" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-nat-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
      + tags_all                           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-nat-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
        }
    }

  # module.network.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route.public_internet_gateway will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # module.network.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-private-rt-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
          + "Type"        = "private"
        }
      + tags_all         = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-private-rt-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
          + "Type"        = "private"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-public-rt"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
          + "Type"        = "public"
        }
      + tags_all         = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-public-rt"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
          + "Type"        = "public"
        }
      + vpc_id           = (known after apply)
    }

  # module.network.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.network.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-private-subnet-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
          + "Type"        = "private"
        }
      + tags_all                                       = {
          + "CostCenter"  = "devops-exam"
          + "Environment" = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "exam-costa-production-private-subnet-1"
          + "Owner"       = "costa"
          + "Project"     = "DevOps Exam Costa"
          + "Purpose"     = "exam-submission"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.network.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id          

... output truncated (too large for comment)
```
</details>